test/fio-outputs/bs512k-read.txt
warmup: (g=0): rw=read, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=xnvme, iodepth=1
bs512k-read: (g=1): rw=read, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=xnvme, iodepth=1
fio-3.20-90-g5bd52
Starting 2 threads
xnvme_fioe: init(): td->io_ops: 0x7f4393236320
xnvme_fioe: init(): td->io_ops: 0x7f4393236320

warmup: (groupid=0, jobs=1): err= 0: pid=19559: Sun Feb 28 20:41:27 2021
  read: IOPS=2739, BW=1370MiB/s (1437MB/s)(1219GiB/910856msec)
    clat (usec): min=111, max=14112, avg=345.02, stdev=80.11
     lat (usec): min=178, max=14541, avg=364.63, stdev=80.14
    clat percentiles (usec):
     |  1.00th=[  176],  5.00th=[  221], 10.00th=[  247], 20.00th=[  277],
     | 30.00th=[  302], 40.00th=[  322], 50.00th=[  343], 60.00th=[  359],
     | 70.00th=[  383], 80.00th=[  408], 90.00th=[  449], 95.00th=[  486],
     | 99.00th=[  553], 99.50th=[  578], 99.90th=[  635], 99.95th=[  660],
     | 99.99th=[  709]
   bw (  MiB/s): min= 1333, max= 1382, per=100.00%, avg=1371.48, stdev= 3.61, samples=1313
   iops        : min= 2666, max= 2765, avg=2742.49, stdev= 7.25, samples=1313
  lat (usec)   : 250=10.90%, 500=85.58%, 750=3.52%, 1000=0.01%
  lat (msec)   : 20=0.01%
  cpu          : usr=94.84%, sys=5.16%, ctx=2018, majf=0, minf=11248
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2495729,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
  steadystate  : attained=yes, bw=1370MiB/s (1403MB/s), iops=2740, iops slope=-0.000%
bs512k-read: (groupid=1, jobs=1): err= 0: pid=19599: Sun Feb 28 20:41:27 2021
  read: IOPS=2740, BW=1370MiB/s (1437MB/s)(1204GiB/900001msec)
    clat (usec): min=78, max=1725, avg=344.74, stdev=79.63
     lat (usec): min=178, max=2070, avg=364.45, stdev=79.63
    clat percentiles (usec):
     |  1.00th=[  176],  5.00th=[  221], 10.00th=[  247], 20.00th=[  277],
     | 30.00th=[  302], 40.00th=[  322], 50.00th=[  343], 60.00th=[  359],
     | 70.00th=[  383], 80.00th=[  408], 90.00th=[  449], 95.00th=[  486],
     | 99.00th=[  553], 99.50th=[  578], 99.90th=[  635], 99.95th=[  660],
     | 99.99th=[  709]
   bw (  MiB/s): min= 1358, max= 1384, per=100.00%, avg=1371.62, stdev= 4.06, samples=1797
   iops        : min= 2716, max= 2768, avg=2743.24, stdev= 8.12, samples=1797
  lat (usec)   : 100=0.01%, 250=10.98%, 500=85.53%, 750=3.49%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=94.81%, sys=5.19%, ctx=2931, majf=0, minf=50271
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2466094,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1370MiB/s (1437MB/s), 1370MiB/s-1370MiB/s (1437MB/s-1437MB/s), io=1219GiB (1308GB), run=910856-910856msec

Run status group 1 (all jobs):
   READ: bw=1370MiB/s (1437MB/s), 1370MiB/s-1370MiB/s (1437MB/s-1437MB/s), io=1204GiB (1293GB), run=900001-900001msec