test/fio-outputs/bs64k-read.txt
warmup: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=xnvme, iodepth=1
bs64k-read: (g=1): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=xnvme, iodepth=1
fio-3.20-90-g5bd52
Starting 2 threads
xnvme_fioe: init(): td->io_ops: 0x7f8abb1a3320
xnvme_fioe: init(): td->io_ops: 0x7f8abb1a3320

warmup: (groupid=0, jobs=1): err= 0: pid=19647: Sun Feb 28 21:12:05 2021
  read: IOPS=21.9k, BW=1372MiB/s (1438MB/s)(1220GiB/910856msec)
    clat (nsec): min=225, max=544729, avg=40024.93, stdev=22261.36
     lat (usec): min=30, max=549, avg=45.17, stdev=22.26
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   26], 10.00th=[   26], 20.00th=[   26],
     | 30.00th=[   26], 40.00th=[   27], 50.00th=[   28], 60.00th=[   33],
     | 70.00th=[   43], 80.00th=[   55], 90.00th=[   74], 95.00th=[   89],
     | 99.00th=[  120], 99.50th=[  130], 99.90th=[  153], 99.95th=[  163],
     | 99.99th=[  180]
   bw (  MiB/s): min= 1359, max= 1384, per=100.00%, avg=1372.97, stdev= 3.52, samples=1313
   iops        : min=21758, max=22153, avg=21967.10, stdev=56.27, samples=1313
  lat (nsec)   : 250=0.01%
  lat (usec)   : 10=0.01%, 20=0.01%, 50=76.81%, 100=20.50%, 250=2.69%
  lat (usec)   : 500=0.01%, 750=0.01%
  cpu          : usr=90.20%, sys=9.80%, ctx=2318, majf=0, minf=2176
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=19987845,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
  steadystate  : attained=yes, bw=1372MiB/s (1405MB/s), iops=21.9k, iops slope=-0.000%
bs64k-read: (groupid=1, jobs=1): err= 0: pid=19666: Sun Feb 28 21:12:05 2021
  read: IOPS=21.9k, BW=1371MiB/s (1438MB/s)(1205GiB/900000msec)
    clat (nsec): min=200, max=922992, avg=39874.66, stdev=22127.49
     lat (usec): min=30, max=928, avg=45.06, stdev=22.13
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   26], 10.00th=[   26], 20.00th=[   26],
     | 30.00th=[   26], 40.00th=[   28], 50.00th=[   28], 60.00th=[   32],
     | 70.00th=[   42], 80.00th=[   54], 90.00th=[   74], 95.00th=[   89],
     | 99.00th=[  120], 99.50th=[  130], 99.90th=[  151], 99.95th=[  163],
     | 99.99th=[  180]
   bw (  MiB/s): min= 1359, max= 1384, per=100.00%, avg=1372.97, stdev= 4.08, samples=1797
   iops        : min=21758, max=22144, avg=21967.56, stdev=65.32, samples=1797
  lat (nsec)   : 250=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=77.15%
  lat (usec)   : 100=20.21%, 250=2.64%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=90.09%, sys=9.90%, ctx=3543, majf=0, minf=310720
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=19748178,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1372MiB/s (1438MB/s), 1372MiB/s-1372MiB/s (1438MB/s-1438MB/s), io=1220GiB (1310GB), run=910856-910856msec

Run status group 1 (all jobs):
   READ: bw=1371MiB/s (1438MB/s), 1371MiB/s-1371MiB/s (1438MB/s-1438MB/s), io=1205GiB (1294GB), run=900000-900000msec